Yuanzjls/Audio_Player_stm32f769disco/Core/Src/main.cpp
  /* DMA2D Initialization */
  hal_status = HAL_DMA2D_DeInit(&Dma2dHandle);
//  OnError_Handler(hal_status != HAL_OK);
  
  hal_status = HAL_DMA2D_Init(&Dma2dHandle);
//  OnError_Handler(hal_status != HAL_OK);

  /* Apply DMA2D Foreground configuration */
  HAL_DMA2D_ConfigLayer(&Dma2dHandle, 1);

  /* Apply DMA2D Background configuration */
  HAL_DMA2D_ConfigLayer(&Dma2dHandle, 0);
}
#if 0
#define PATTERN_SEARCH_BUFFERSIZE 512
uint8_t PatternSearchBuffer[PATTERN_SEARCH_BUFFERSIZE];
uint32_t JPEG_FindFrameOffset(uint32_t offset, FIL *file)
{
  uint32_t index = offset, i, readSize=0;

  do
  {
    if (f_size(file) <= (index+1))
    {
      return 0;
    }
    f_lseek(file, index);
    f_read(file, PatternSearchBuffer, PATTERN_SEARCH_BUFFERSIZE, (UINT *)&readSize);
    if (readSize!=0)
    {
      for (i=0; i<(readSize-1); i++)
      {
        if ((PatternSearchBuffer[i]==JPEG_SOI_MARKER_BYTE1) && (PatternSearchBuffer[i+1] == JPEG_SOI_MARKER_BYTE0))
        {
          return index + i;
        }
      }
      index += (readSize - 1);
    }
  } while (readSize!=0);

  return 0;
}

#endif
AUDIO_DrvTypeDef *audio_drv;
static void Playback_Init(uint32_t SampleRate)
{
  RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct;
  
  /* Configure PLLSAI prescalers */
  /* PLLSAI_VCO: VCO_429M 
     SAI_CLK(first level) = PLLSAI_VCO/PLLSAIQ = 429/2 = 214.5 Mhz
     SAI_CLK_x = SAI_CLK(first level)/PLLSAIDIVQ = 214.5/19 = 11.289 Mhz */ 
  RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
  RCC_PeriphCLKInitStruct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLSAI;
  RCC_PeriphCLKInitStruct.PLLSAI.PLLSAIN = 429; 
  RCC_PeriphCLKInitStruct.PLLSAI.PLLSAIQ = 2; 
  RCC_PeriphCLKInitStruct.PLLSAIDivQ = 19;     
  
  if(HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /* Initialize SAI */
  __HAL_SAI_RESET_HANDLE_STATE(&SaiHandle);

  SaiHandle.Instance = AUDIO_SAIx;

  __HAL_SAI_DISABLE(&SaiHandle);

  SaiHandle.Init.AudioMode      = SAI_MODEMASTER_TX;
  SaiHandle.Init.Synchro        = SAI_ASYNCHRONOUS;
  SaiHandle.Init.OutputDrive    = SAI_OUTPUTDRIVE_ENABLE;
  SaiHandle.Init.NoDivider      = SAI_MASTERDIVIDER_ENABLE;
  SaiHandle.Init.FIFOThreshold  = SAI_FIFOTHRESHOLD_1QF;
  SaiHandle.Init.AudioFrequency = SampleRate;
  SaiHandle.Init.Protocol       = SAI_FREE_PROTOCOL;
  SaiHandle.Init.DataSize       = SAI_DATASIZE_16;
  SaiHandle.Init.FirstBit       = SAI_FIRSTBIT_MSB;
  SaiHandle.Init.ClockStrobing  = SAI_CLOCKSTROBING_FALLINGEDGE;

  SaiHandle.FrameInit.FrameLength       = 32;
  SaiHandle.FrameInit.ActiveFrameLength = 16;
  SaiHandle.FrameInit.FSDefinition      = SAI_FS_CHANNEL_IDENTIFICATION;
  SaiHandle.FrameInit.FSPolarity        = SAI_FS_ACTIVE_LOW;
  SaiHandle.FrameInit.FSOffset          = SAI_FS_BEFOREFIRSTBIT;

  SaiHandle.SlotInit.FirstBitOffset = 0;
  SaiHandle.SlotInit.SlotSize       = SAI_SLOTSIZE_DATASIZE;
  SaiHandle.SlotInit.SlotNumber     = 2; 
  SaiHandle.SlotInit.SlotActive     = (SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1);

  if(HAL_OK != HAL_SAI_Init(&SaiHandle))
  {
    Error_Handler();
  }
  
  /* Enable SAI to generate clock used by audio driver */
  __HAL_SAI_ENABLE(&SaiHandle);
  
  /* Initialize audio driver */
  if(WM8994_ID != wm8994_drv.ReadID(AUDIO_I2C_ADDRESS))
  {
    Error_Handler();
  }
  
  audio_drv = &wm8994_drv;
  audio_drv->Reset(AUDIO_I2C_ADDRESS);  
  if(0 != audio_drv->Init(AUDIO_I2C_ADDRESS, OUTPUT_DEVICE_HEADPHONE, 20, SampleRate ))
  {
    Error_Handler();
  }
}

FIL fi;

/*gif call back functions start */
void screenClearCallback(void)
{
	BSP_LCD_Clear(LCD_COLOR_BLACK);
}
#if 0
void updateScreenCallback(void)
{
	uint32_t xPos = (BSP_LCD_GetXSize() - decoder.GetGifWidth())/2;
	uint32_t yPos = (BSP_LCD_GetYSize() - decoder.GetGifHeight())/2;
	CopyPicture((uint32_t *)IMAGEBUFF_ADDRESS, (uint32_t *)LAYER1_ADDRESS, xPos, yPos, decoder.GetGifWidth(), decoder.GetGifHeight());
}
void drawPixelCallback(int16_t x, int16_t y, uint8_t red, uint8_t green, uint8_t blue)
{
	*((uint32_t*)(IMAGEBUFF_ADDRESS+(x+y* (decoder.GetGifWidth()))*4)) = ((uint16_t)red << 16) | ((uint16_t)green << 8) | (blue);
}
#endif
bool fileSeekCallback(unsigned long position) 
{
	if (f_lseek(&fi, position) == FR_OK)
	{
		return true;
	}
	else
	{
		return false;
	}
}

unsigned long filePositionCallback(void) 
{
    return f_tell(&fi);
}
int fileReadCallback(void) 
{
    uint8_t b;
    FRESULT fr;
    UINT ReadLen;
    fr = f_read(&fi, &b, 1, &ReadLen);
    if (fr == FR_OK && ReadLen == 1)
    {
      return b;
    }
    else
    {
      return -1;
    }
}
#define BlockReadSize 512
#define BlockBuffer PatternSearchBuffer
int fileReadBlockCallback(void * buffer, int numberOfBytes) 
{
    uint8_t b;
    FRESULT fr;
    UINT ReadLen;

    fr = f_read(&fi, buffer, numberOfBytes, &ReadLen);
    if (fr == FR_OK)
    {
      return ReadLen;
    }
    else
    {
      return -1;
    }
    
}
/*gif call back functions end */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
uint32_t FrameOffset=0;
const uint16_t block_size = 40960;
uint16_t buff[block_size];
#define PLAY_HEADER          0x2C
bool flag = 0;
Wavheader Wheader;
static TaskHandle_t xTaskLed = NULL;
static TaskHandle_t xTaskMusic = NULL;
static void vTaskLed(void *pvParameters)
{
  while(1)
  {
    BSP_LED_Toggle(LED2);
    vTaskDelay(400);
  }
}

static void vTaskMusic(void *pvParameters)
{
  FRESULT fr;
  DIR dj;
  FILINFO fno;
  FATFS fs;
  unsigned int length=0;
  uint32_t ulNotifiedValue;
  if (f_mount(&fs,(char*)"",1) == FR_OK)
  {
    if (f_open(&fi, "Music.wav", FA_READ) == FR_OK)
    {
    	f_read(&fi, (void *)&Wheader, sizeof(Wheader), &length);
        f_lseek(&fi, PLAY_HEADER);
        f_read(&fi, buff, block_size*2, &length);
        Playback_Init(Wheader.Samplerate);
        HAL_SAI_Transmit_DMA(&SaiHandle, (uint8_t *)buff, block_size);
        while(1)
        {
          xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, 500);
          if (ulNotifiedValue)
          {
            if (ulNotifiedValue  & 0x01)
            {
              f_read(&fi, &buff[block_size/2], block_size, &length);
            }   
            if (ulNotifiedValue  & 0x02)
            {
              f_read(&fi, &buff[0], block_size, &length);
            }
            if (length != block_size)
            {
              f_lseek(&fi, PLAY_HEADER);
            }
            BSP_LED_Toggle(LED_RED);
          }
        }
    }
  }
}


static void AppTaskCreate(void)
{
  xTaskCreate(vTaskLed, "TaskLed", 512, NULL, 1, &xTaskLed);
  xTaskCreate(vTaskMusic, "TaskMusic", 1024, NULL, 4, &xTaskMusic);
}

int main(void)
{
  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */
	

